[
  {
    "id": 1,
    "nome": "Emanuel Avgerino",
    "vaga": "Estágio TI",
    "descricao": "Sou estudante de Engenharia de Software, atualmente no 4º período, com bastante interesse em desenvolvimento web. Tenho experiência com HTML, CSS e JavaScript, e venho me aprofundando em React.",
    "avatar": "E"
  },
  {
    "id": 2,
    "nome": "Fabio Figueiredo",
    "vaga": "Estágio TI",
    "descricao": "Curso Análise de Sistemas e busco sempre aprender. Tenho conhecimento em Python, MySQL e Git, e já participei de hackathons e minicursos.",
    "avatar": "F"
  },
  {
    "id": 3,
    "nome": "Giovana Rocha",
    "vaga": "Estágio TI",
    "descricao": "Estudo Ciência da Computação e amo UX/UI. Trabalhei com Figma, HTML, CSS e JavaScript em projetos acadêmicos, e sou ótima comunicadora.",
    "avatar": "G"
  },
  {
    "id": 4,
    "nome": "Wictória Salgado",
    "vaga": "Estágio TI",
    "descricao": "Cursando Sistemas de Informação, foco no back end. Tenho conhecimento em Java, Python e lógica de programação.",
    "avatar": "W"
  },
  {
    "id": 5,
    "nome": "Vinícius Dantas",
    "vaga": "Estágio Redes",
    "descricao": "Estudo Redes de Computadores. Tenho prática com infraestrutura, roteadores e protocolos. Proativo e organizado.",
    "avatar": "V"
  },
  {
    "id": 6,
    "nome": "Camila Martins",
    "vaga": "Estágio QA",
    "descricao": "Sou detalhista e amo testar software. Estudo Engenharia da Computação e conheço ferramentas como Selenium e JUnit.",
    "avatar": "C"
  },
  {
    "id": 7,
    "nome": "Rodrigo Lima",
    "vaga": "Estágio Suporte",
    "descricao": "Tenho experiência em suporte técnico, formatação de PCs, redes e atendimento ao cliente. Estudante de ADS.",
    "avatar": "R"
  },
  {
    "id": 8,
    "nome": "Juliana Nogueira",
    "vaga": "Estágio Design",
    "descricao": "Estudante de Design Digital. Trabalho com Adobe XD, Illustrator e Figma. Gosto de criar interfaces intuitivas e acessíveis.",
    "avatar": "J"
  },
  {
    "id": 9,
    "nome": "Diego Ramos",
    "vaga": "Estágio Dados",
    "descricao": "Foco em análise de dados. Conhecimento em Python, Pandas, SQL e Power BI. Participei de projeto de análise de churn para e-commerce.",
    "avatar": "D"
  },
  {
    "id": 10,
    "nome": "Beatriz Costa",
    "vaga": "Estágio Full Stack",
    "descricao": "Conhecimento em Node.js, React e bancos de dados SQL/NoSQL. Participa de bootcamp e projetos open source.",
    "avatar": "B"
  }
]
